In [1]:
#pandas liberary
import pandas as pd

#create pandas series form list
s = pd.Series([1, 2, 3, 4, 5])
print(s)

#creating a pandas series witha a specified index
s = pd.Series([1, 2, 3, 4, 5], index=['a', 'b', 'c', 'd', 'e'])
print(s)

#creating a pandas series from a dictionary
s = pd.Series({'a': 1, 'b': 2, 'c': 3, 'd': 4, 'e': 5})
print(s)

#accessing elements in a pandas series
print(s['a'])  # Access by label
print(s[0])    # Access by position

0    1
1    2
2    3
3    4
4    5
dtype: int64
a    1
b    2
c    3
d    4
e    5
dtype: int64
a    1
b    2
c    3
d    4
e    5
dtype: int64
1
1

C:\Users\athar\AppData\Local\Temp\ipykernel_3008\2378282909.py:18: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(s[0])    # Access by position

In [2]:
first_n_rows = s.head(3)  # Get first 3 rows
print(first_n_rows)

#return last n rows
last_n_rows = s.tail(2)  # Get last 2 rows
print(last_n_rows)

#return dimentipns rows and coulmns
print(s.shape)  

#generate descriptive statics
print(s.describe())  

#retuern unique values
print(s.unique())

a    1
b    2
c    3
dtype: int64
d    4
e    5
dtype: int64
(5,)
count    5.000000
mean     3.000000
std      1.581139
min      1.000000
25%      2.000000
50%      3.000000
75%      4.000000
max      5.000000
dtype: float64
[1 2 3 4 5]

In [ ]:
#CREATE A PANDAS SEREIS FOR TEMPERATURE DATA
temperature_data = pd.Series([30, 32, 31, 29, 28], index=['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday'])


#use list of daily temperatures to create a pandas series
print(temperature_data)

#assign days of week as the index 
print(temperature_data['Monday'])  # Access temperature for Monday
print(temperature_data['Wednesday'])  # Access temperature for Wednesday
print(temperature_data['Friday'])  # Access temperature for Friday

#access and manipulate the temperature data
#access the temperature data for specific days using index labels
print(temperature_data[['Monday', 'Friday']])  
#calculate the total temperature for the week
total_temperature = temperature_data.sum()
print("Total temperature for the week:", total_temperature)

#identify the temp of highest and lowest temperature
highest_temp = temperature_data.max()
lowest_temp = temperature_data.min()
print("Highest temperature:", highest_temp)
print("Lowest temperature:", lowest_temp)

#calculate the average temperature for the week
average_temp = temperature_data.mean()
print("Average temperature for the week:", average_temp)


significant_diff_days = temperature_data[]
print("Days with significant temperature difference from average:")
print(significant_diff_days)

Monday       30
Tuesday      32
Wednesday    31
Thursday     29
Friday       28
dtype: int64
30
31
28
Monday    30
Friday    28
dtype: int64
Total temperature for the week: 150
Highest temperature: 32
Lowest temperature: 28
Average temperature for the week: 30.0
Days with significant temperature difference from average:
Series([], dtype: int64)

Argmax argmin when numpy

idxmax idxmin when pandas

In [2]:
import pandas as pd
#dictionary
data = {"Name" : ["Raj","Simran","Sameer"],
        "Age" : [28,24,25],
        "Salary": [28000,22000,18000]
        }
df= pd.DataFrame(data)
df

     Name  Age  Salary
0     Raj   28   28000
1  Simran   24   22000
2  Sameer   25   18000

In [4]:
#datafram from list
data_list = [["Raj",28,28000],
         ["Simran",24,25000],
         ["Sameer",22,18000]
        ]
df2= pd.DataFrame(data_list,columns = ["Name","Age","Salary"])
df2

     Name  Age  Salary
0     Raj   28   28000
1  Simran   24   25000
2  Sameer   22   18000

In [14]:
housing_data = pd.read_csv('HousePrices.csv')
housing_data

,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,street,city,statezip,country
0,2014-05-02 00:00:00,3.130000e+05,3.0,1.50,1340,7912,1.5,0,0,3,1340,0,1955,2005,18810 Densmore Ave N,Shoreline,WA 98133,USA
1,2014-05-02 00:00:00,2.384000e+06,5.0,2.50,3650,9050,2.0,0,4,5,3370,280,1921,0,709 W Blaine St,Seattle,WA 98119,USA
2,2014-05-02 00:00:00,3.420000e+05,3.0,2.00,1930,11947,1.0,0,0,4,1930,0,1966,0,26206-26214 143rd Ave SE,Kent,WA 98042,USA
3,2014-05-02 00:00:00,4.200000e+05,3.0,2.25,2000,8030,1.0,0,0,4,1000,1000,1963,0,857 170th Pl NE,Bellevue,WA 98008,USA
4,2014-05-02 00:00:00,5.500000e+05,4.0,2.50,1940,10500,1.0,0,0,4,1140,800,1976,1992,9105 170th Ave NE,Redmond,WA 98052,USA
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4595,2014-07-09 00:00:00,3.081667e+05,3.0,1.75,1510,6360,1.0,0,0,4,1510,0,1954,1979,501 N 143rd St,Seattle,WA 98133,USA
4596,2014-07-09 00:00:00,5.343333e+05,3.0,2.50,1460,7573,2.0,0,0,3,1460,0,1983,2009,14855 SE 10th Pl,Bellevue,WA 98007,USA
4597,2014-07-09 00:00:00,4.169042e+05,3.0,2.50,3010,7014,2.0,0,0,3,3010,0,2009,0,759 Ilwaco Pl NE,Renton,WA 98059,USA
4598,2014-07-10 00:00:00,2.034000e+05,4.0,2.00,2090,6630,1.0,0,0,3,1070,1020,1974,0,5148 S Creston St,Seattle,WA 98178,USA
4599,2014-07-10 00:00:00,2.206000e+05,3.0,2.50,1490,8102,2.0,0,0,4,1490,0,1990,0,18717 SE 258th St,Covington,WA 98042,USA

In [17]:
iris_df = pd.read_excel('Iris.xlsx')
iris_df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [18]:
iris_df.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [19]:
iris_df['species'].nunique()

3

In [20]:
iris_df['species'].value_counts()

species
setosa        50
versicolor    50
virginica     50
Name: count, dtype: int64

In [21]:
iris_df.iloc[0]

sepal_length       5.1
sepal_width        3.5
petal_length       1.4
petal_width        0.2
species         setosa
Name: 0, dtype: object

In [22]:
iris_df.at[2,'species']

'setosa'

In [23]:
iris_df.iat[1,2]

1.4

In [24]:
iris_df.loc[10,'species']

'setosa'

In [25]:
housing_data

,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,street,city,statezip,country
0,2014-05-02 00:00:00,3.130000e+05,3.0,1.50,1340,7912,1.5,0,0,3,1340,0,1955,2005,18810 Densmore Ave N,Shoreline,WA 98133,USA
1,2014-05-02 00:00:00,2.384000e+06,5.0,2.50,3650,9050,2.0,0,4,5,3370,280,1921,0,709 W Blaine St,Seattle,WA 98119,USA
2,2014-05-02 00:00:00,3.420000e+05,3.0,2.00,1930,11947,1.0,0,0,4,1930,0,1966,0,26206-26214 143rd Ave SE,Kent,WA 98042,USA
3,2014-05-02 00:00:00,4.200000e+05,3.0,2.25,2000,8030,1.0,0,0,4,1000,1000,1963,0,857 170th Pl NE,Bellevue,WA 98008,USA
4,2014-05-02 00:00:00,5.500000e+05,4.0,2.50,1940,10500,1.0,0,0,4,1140,800,1976,1992,9105 170th Ave NE,Redmond,WA 98052,USA
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4595,2014-07-09 00:00:00,3.081667e+05,3.0,1.75,1510,6360,1.0,0,0,4,1510,0,1954,1979,501 N 143rd St,Seattle,WA 98133,USA
4596,2014-07-09 00:00:00,5.343333e+05,3.0,2.50,1460,7573,2.0,0,0,3,1460,0,1983,2009,14855 SE 10th Pl,Bellevue,WA 98007,USA
4597,2014-07-09 00:00:00,4.169042e+05,3.0,2.50,3010,7014,2.0,0,0,3,3010,0,2009,0,759 Ilwaco Pl NE,Renton,WA 98059,USA
4598,2014-07-10 00:00:00,2.034000e+05,4.0,2.00,2090,6630,1.0,0,0,3,1070,1020,1974,0,5148 S Creston St,Seattle,WA 98178,USA
4599,2014-07-10 00:00:00,2.206000e+05,3.0,2.50,1490,8102,2.0,0,0,4,1490,0,1990,0,18717 SE 258th St,Covington,WA 98042,USA

In [ ]:
import pandas as pd
from datetime import datetime

In [29]:
today = datetime.datetime.now()
print("Today's date:", today)

Today's date: 2025-06-10 15:45:56.952691

In [32]:
from datetime import timedelta

next_day = today + timedelta(days=1)
print("Next day:", next_day)

Next day: 2025-06-11 15:45:56.952691

In [35]:
date_range = pd.date_range(start='2025-01-01', end='2025-10-10',freq="MS")
print("Date range:", date_range)

Date range: DatetimeIndex(['2025-01-01', '2025-02-01', '2025-03-01', '2025-04-01',
               '2025-05-01', '2025-06-01', '2025-07-01', '2025-08-01',
               '2025-09-01', '2025-10-01'],
              dtype='datetime64[ns]', freq='MS')

In [38]:
# Assign date_range to a new 'Date' column in df
df["Date"] = date_range[:len(df)]
print("DataFrame with Date column:")
print(df)

DataFrame with Date column:
     Name  Age  Salary       Date
0     Raj   28   28000 2025-01-01
1  Simran   24   22000 2025-02-01
2  Sameer   25   18000 2025-03-01

In [39]:
df["Day"] = df["Date"].dt.day
df["Month"] = df["Date"].dt.month
df["Year"] = df["Date"].dt.year
print("DataFrame with Day, Month, and Year columns:")
print(df)

DataFrame with Day, Month, and Year columns:
     Name  Age  Salary       Date  Day  Month  Year
0     Raj   28   28000 2025-01-01    1      1  2025
1  Simran   24   22000 2025-02-01    1      2  2025
2  Sameer   25   18000 2025-03-01    1      3  2025

In [42]:

df["Is_Weekend"] = df["Day_of_Week"].isin(["Saturday", "Sunday"])
df["Is_Weekend"] = df["Date"].dt.dayofweek >= 5
print("DataFrame with Is_Weekend column:")
print(df)

DataFrame with Is_Weekend column:
     Name  Age  Salary       Date  Day  Month  Year  Is_Weekend Day_of_Week
0     Raj   28   28000 2025-01-01    1      1  2025       False   Wednesday
1  Simran   24   22000 2025-02-01    1      2  2025        True    Saturday
2  Sameer   25   18000 2025-03-01    1      3  2025        True    Saturday